app/controllers/attendances_controller.rb

SELECT * FROM "students" WHERE (school_id = 1 ) ORDER BY last_name
---
  def index
    @opendoor_students = Student.find(:all, :conditions => "school_id = 1 and inactive = nil", :order => "last_name")

SELECT * FROM "attendances" WHERE ("attendances"."id" = 0)
---
  def show
    @attendance = Attendance.find(params[:id])

SELECT * FROM "students" ORDER BY last_name
INSERT INTO "attendances" ("student_id", "created_at", "updated_at", "date", "number_of_classes") VALUES(1, '2010-12-01 18:16:54', '2010-12-01 18:16:54', NULL, 1)
---
  def create
    @students = Student.find(:all, :conditions => "inactive = nil", :order => "last_name")
    @students.each { |student|
      num_classes = 0
      params["student#{student.id}"].each {|key, value|
        num_classes += value.to_i();
      }
      if (num_classes > 0)
        student.attendances << Attendance.new(:number_of_classes => num_classes,
                                              :date => Date.today)