app/controllers/reports_controller.rb

  def test_eligibility

      @schools = School.find(:all, :order => "name")
      @students_eligible_to_test = Array.new
      actual_test_date = params[:test_date]

      if actual_test_date != nil && actual_test_date.length > 0 then
        actual_test_date = Date.parse(actual_test_date)
        students = students_to_check(params[:school])

        fudge_factor = 0
        if params[:fudge_factor] != nil && params[:fudge_factor].length > 0 then
          fudge_factor = params[:fudge_factor]
        end

        students.each { |student|
---
SELECT * FROM "schools" ORDER BY name