app/controllers/schools_controller.rb

SELECT * FROM "schools" WHERE ("schools"."id" = 1)
---
  def show
    @school = School.find(params[:id])

INSERT INTO "schools" ("name", "created_at", "updated_at") VALUES('OpenDoor TaeKwonDo', '2010-12-04 14:50:08', '2010-12-04 14:50:08')
---
  def create
    @school = School.new(params[:school])

    respond_to do |format|
      if @school.save