app/controllers/students_controller.rb

SELECT * FROM "students" WHERE ("students"."id" = 1)
---
  def show
    @student = Student.find(params[:id])

SELECT * FROM "students" WHERE ("students"."id" = 1)
---
  def edit
    @student = Student.find(params[:id])

INSERT INTO "students" ("created_at", "updated_at", "rank", "last_name", "last_test", "phone", "email_address", "classes_since_last_test", "first_name") VALUES('2010-11-30 00:55:20', '2010-11-30 00:55:20', 2, 'Banks', '2010-01-02', '', 'heather@banks.net', 20, 'Heather')
---
  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save

SELECT * FROM "students" WHERE ("students"."id" = 9)
INSERT INTO "attendances" ("student_id", "created_at", "updated_at", "number_of_classes") VALUES(9, '2010-12-06 16:27:50', '2010-12-06 16:27:50', 1)
UPDATE "students" SET "last_test" = '2010-12-06', "updated_at" = '2010-12-06 16:15:24' WHERE "id" = 9
---
  def update
    @student = Student.find(params[:id])

    if params[:number_of_classes] != nil then
      attendance = Attendance.new
      attendance.student_id = @student.id
      attendance.number_of_classes = params[:number_of_classes]
      attendance.save
      flash[:notice] = 'Student was successfully updated.'
    end

    respond_to do |format|
      if @student.update_attributes(params[:student])

SELECT * FROM "students" WHERE ("students"."id" = 84)
DELETE FROM "students" WHERE "id" = 84
---
  def destroy
    @student = Student.find(params[:id])
    @student.destroy